[
    {
        "id": 1,
        "title": "Getting Started and Account Registration",
        "content": "Welcome to CloudDesk, your all-in-one cloud-based project management and team collaboration platform. Getting started is quick and easy. To create your account, visit our website at clouddesk.io and click the Sign Up button in the top right corner. You will need to provide your full name, a valid email address, and create a secure password. Passwords must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number, and one special character such as @, #, $, or !. After submitting the registration form, we will send a verification email to your inbox within 2 minutes. Click the verification link in that email to activate your account. If you do not see the email, please check your spam or junk folder. Once verified, you can log in and start setting up your workspace. During the initial setup wizard, you will be asked to name your workspace, invite team members via email, and choose your preferred theme (light or dark mode). You can also upload a company logo that will appear in the sidebar. CloudDesk supports Single Sign-On (SSO) with Google, Microsoft, and GitHub for faster login. If your organization uses SAML-based SSO, Enterprise plan administrators can configure it from Settings, then Security, then SSO Configuration. For security, we recommend enabling Two-Factor Authentication immediately after account creation. Navigate to Settings, then Security, then Two-Factor Authentication to set up verification via an authenticator app such as Google Authenticator or Authy. We also provide backup recovery codes in case you lose access to your 2FA device. Store these codes in a safe place."
    },
    {
        "id": 2,
        "title": "Project Management and Task Tracking",
        "content": "CloudDesk provides powerful project management tools designed for teams of all sizes. To create a new project, navigate to the Projects section in the left sidebar and click Create Project. You can choose from several project templates including Kanban Board, Gantt Chart, Sprint Board, and Blank Project. Each project can have unlimited task lists, and each task list can contain unlimited tasks. Tasks in CloudDesk support rich features including title, description with markdown formatting, priority levels (Critical, High, Medium, Low), due dates, time estimates, assignees, labels, attachments, and subtasks. You can assign multiple team members to a single task and set watchers who receive notifications about task updates. The Kanban view allows you to drag and drop tasks between columns such as To Do, In Progress, Review, and Done. You can customize column names and add new columns to match your workflow. The Gantt Chart view provides a timeline visualization of your project schedule, showing task dependencies and milestones. You can set task dependencies so that one task cannot start until another is completed. CloudDesk also supports recurring tasks, which can be set to repeat daily, weekly, monthly, or on custom schedules. Task automation rules let you automatically move tasks between columns, assign team members, or send notifications based on triggers. For example, you can create a rule that automatically moves a task to the Review column when all subtasks are completed. Sprint planning is available for agile teams. You can create sprints with start and end dates, add tasks to sprints, and track velocity with burndown charts. The dashboard shows project analytics including task completion rates, team workload distribution, and overdue task counts."
    },
    {
        "id": 3,
        "title": "Team Collaboration and Communication",
        "content": "Effective team collaboration is at the heart of CloudDesk. Our built-in messaging system allows team members to communicate in real-time without switching between applications. There are three types of conversations: Direct Messages for one-on-one chats, Group Channels for team-wide discussions, and Project Channels that are automatically created for each project. To start a direct message, click the Messages icon in the sidebar and search for a team member by name or email. Group channels can be created by any team member from the Channels section. Channels can be public, meaning visible to all workspace members, or private, meaning invite-only. Messages support rich text formatting, code blocks with syntax highlighting, file attachments up to 50MB, emoji reactions, threaded replies, and message pinning. You can mention specific team members using the @ symbol or notify the entire channel with @everyone. CloudDesk also features audio and video calls directly within the platform. You can start a call from any conversation by clicking the phone or video icon. Calls support up to 25 participants on the Professional plan and up to 100 on the Enterprise plan. Screen sharing is available during calls, and you can record meetings for later review. Meeting recordings are stored in your workspace file storage. Additionally, CloudDesk integrates with popular communication tools. You can connect Slack, Microsoft Teams, or Discord to receive CloudDesk notifications in your preferred messaging tool. Integration settings are available from Settings, then Integrations, then Communication."
    },
    {
        "id": 4,
        "title": "Billing, Pricing Plans, and Subscriptions",
        "content": "CloudDesk offers flexible pricing plans to suit teams of every size. The Free plan includes up to 5 team members, 3 projects, 500MB storage, and basic task management features. The Starter plan costs $9 per user per month when billed annually or $12 per user per month when billed monthly. It includes unlimited projects, 5GB storage per user, Kanban and list views, basic integrations, and email support. The Professional plan costs $19 per user per month (annual) or $24 per user per month (monthly). It includes everything in Starter plus Gantt charts, time tracking, sprint planning, advanced integrations, video calls with up to 25 participants, priority support, and 20GB storage per user. The Enterprise plan costs $39 per user per month (annual) with custom monthly pricing available. It includes everything in Professional plus SAML SSO, advanced security controls, audit logs, custom roles and permissions, 24/7 phone support, a dedicated account manager, unlimited storage, API access with higher rate limits, and SLA guarantees. All paid plans come with a 14-day free trial. No credit card is required to start the trial. You can manage your subscription from Settings, then Billing. Here you can upgrade or downgrade your plan, update payment methods, view invoices, and download receipts. We accept Visa, Mastercard, American Express, and PayPal. Refunds are available within 30 days of purchase for annual plans if the service has been used for less than 7 days. To request a refund, contact billing@clouddesk.io or use the in-app support chat."
    },
    {
        "id": 5,
        "title": "Security, Data Privacy, and Compliance",
        "content": "CloudDesk takes security and data privacy extremely seriously. All data is encrypted in transit using TLS 1.3 and at rest using AES-256 encryption. Our infrastructure is hosted on AWS with multi-region redundancy across US, EU, and Asia-Pacific regions. We maintain SOC 2 Type II certification, are GDPR compliant, and follow CCPA requirements. For account security, we support Two-Factor Authentication via authenticator apps with TOTP and SMS verification. Enterprise customers can configure SAML-based Single Sign-On with identity providers like Okta, Azure AD, and OneLogin. Session management allows administrators to view all active sessions and remotely terminate suspicious logins from Settings, then Security, then Active Sessions. Password policies can be customized by workspace administrators. You can enforce minimum password length, complexity requirements, password expiration intervals, and prevent password reuse for the last 10 passwords. Failed login attempts trigger account lockout after 5 consecutive failures, with automatic unlock after 30 minutes. Our audit log tracks all significant actions in your workspace including user logins, project changes, file uploads, permission modifications, and data exports. Audit logs are retained for 1 year on Professional plans and 3 years on Enterprise plans. Data residency options allow Enterprise customers to choose where their data is stored, either US or EU. For data export, you can download all your workspace data at any time from Settings, then Data, then Export. Supported formats include JSON and CSV. We also support the right to be forgotten under GDPR. Users can request complete account and data deletion, which is processed within 14 business days."
    },
    {
        "id": 6,
        "title": "API Access and Developer Integrations",
        "content": "CloudDesk provides a comprehensive REST API for developers to build custom integrations and automate workflows. API access is available on Starter plans and above. To get started, generate an API key from Settings, then Developer, then API Keys. You can create multiple API keys with different permission scopes such as read-only, read-write, or admin. API keys should be included in the Authorization header as a Bearer token. Our API uses JSON format for all requests and responses. The base URL is https://api.clouddesk.io/v1. Key endpoints include Projects (CRUD operations, list members, manage settings), Tasks (create, update, assign, move between lists, add comments), Users (list workspace members, invite users, manage roles), Messages (send messages, list conversations, search message history), and Files (upload, download, list, delete files). API rate limits vary by plan. Starter plans allow 100 requests per minute, Professional allows 500 requests per minute, and Enterprise allows 2000 requests per minute with burst support. When you exceed the rate limit, the API returns a 429 status code with a Retry-After header. Webhook support is also available. You can configure webhooks from Settings, then Developer, then Webhooks. Supported events include task.created, task.updated, task.completed, project.created, message.sent, and user.joined. Webhooks use HMAC-SHA256 for signature verification. Failed webhook deliveries are retried up to 5 times with exponential backoff. Additionally, CloudDesk offers pre-built integrations with GitHub, GitLab, Jira, Trello, Google Drive, Dropbox, Figma, and Zapier. These integrations can be enabled from Settings, then Integrations."
    },
    {
        "id": 7,
        "title": "File Storage, Sharing, and Document Management",
        "content": "CloudDesk includes built-in file storage and document management capabilities. Every workspace has a shared file library accessible from the Files section in the sidebar. Files can also be attached directly to tasks, messages, and project wikis. Upload limits vary by plan. The Free plan allows files up to 10MB each with 500MB total workspace storage. Starter plans support files up to 25MB with 5GB per user. Professional plans allow 50MB files with 20GB per user. Enterprise plans support 200MB files with unlimited storage. Supported file formats include documents like PDF, DOCX, XLSX, PPTX, and TXT; images like PNG, JPG, GIF, SVG, and WebP; code files; archives like ZIP and RAR; and media files like MP4 and MP3. CloudDesk provides preview capabilities for most file types directly in the browser without downloading. PDF documents, images, and text files can be previewed inline. For document collaboration, CloudDesk integrates with Google Docs and Microsoft Office 365. You can link documents from these services and they will appear in your project file list with real-time collaborative editing. File sharing outside your workspace is available through shareable links. You can generate a link with view-only or download permissions and set an expiration date. Links can be password protected for additional security. File versioning automatically tracks changes. Each time a file is re-uploaded with the same name, the previous version is preserved. You can view version history and restore any previous version from the file details panel."
    },
    {
        "id": 8,
        "title": "Notifications and Alert Preferences",
        "content": "CloudDesk provides a comprehensive notification system to keep you informed about important updates. You can customize your notification preferences from Settings, then Notifications. Notifications are delivered through three channels: in-app notifications shown in the bell icon, email notifications, and push notifications on mobile devices. You can configure which events trigger notifications. Available notification types include task assignments, task due date reminders, task status changes, mentions in messages, replies to your messages, project invitations, file shares, and weekly activity digests. Each notification type can be individually enabled or disabled for each delivery channel. Quiet hours allow you to silence notifications during specific times. You can set daily quiet hours such as 10 PM to 8 AM or configure different schedules for weekdays and weekends. During quiet hours, notifications are queued and delivered when quiet hours end. Do Not Disturb mode temporarily silences all notifications for a specified duration."
    },
    {
        "id": 9,
        "title": "Mobile Applications and Cross-Platform Access",
        "content": "CloudDesk is available on all major platforms. Our web application works on Chrome, Firefox, Safari, and Edge. Native desktop applications are available for Windows and macOS, downloadable from our website. Mobile apps are available for iOS version 15 and above and Android version 10 and above. Download from the App Store or Google Play Store by searching for CloudDesk. The mobile app supports full project and task management, real-time messaging and notifications, file viewing and uploading, push notifications with customizable alerts, offline mode for viewing tasks and messages, and biometric authentication including Face ID and fingerprint. The mobile app syncs automatically with the web platform. Changes made on any device are reflected across all devices in real time. For enterprise deployments, CloudDesk supports Mobile Device Management or MDM configuration through solutions like Microsoft Intune and VMware Workspace ONE."
    },
    {
        "id": 10,
        "title": "Customer Support and Help Resources",
        "content": "CloudDesk offers multiple support channels to help you get the most out of our platform. Our Help Center at help.clouddesk.io contains over 200 articles, tutorials, and video guides organized by topic. The Knowledge Base covers getting started guides, feature tutorials, troubleshooting articles, best practices, and FAQ sections. For direct support, you can reach us through the following channels. Email support is available at support@clouddesk.io with response times of 24 hours for Free and Starter plans, 4 hours for Professional plans, and 1 hour for Enterprise plans. In-app live chat is available Monday through Friday from 9 AM to 6 PM EST for Professional and Enterprise plans. Phone support at 1-800-CLOUDDESK is available 24/7 for Enterprise plan customers only. Additionally, Enterprise customers receive a dedicated account manager and can schedule regular check-in calls. Our Community Forum at community.clouddesk.io allows users to share tips, request features, and connect with other CloudDesk users. We also host monthly webinars covering new features and advanced usage tips. Check our Events page for the schedule. For urgent platform issues, check our status page at status.clouddesk.io for real-time system health updates. Subscribe to status updates via email or SMS to be notified of any incidents."
    }
]